! = means that i did not fullly undrstand the concept

1- data exploration

In [2]:
# import modules
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [10]:
# read csv file
df = pd.read_csv('train.csv')
df
# note : you can use .head(default:5) or .tail(default:5) to see the first or last 5 rows of the data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
#number of rows and columns
df.shape

(891, 12)

In [ ]:
# filtering null values
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# info of the dataframe using .info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# describe of the dataframe using .describe() (with the include='all' include the non-numeric columns)
df.describe(include='all')
# .describe() = numeric values / .info() = all values overview

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [ ]:
#  you can access the datfarme's colums and indexes with .columns and .index

In [ ]:
# Std = Standard variation represents the average distance between each data point and the mean of the dat a. It is a key metric used in 
# statistical analysis to understand the distribution of data and to identify outliers. 25% = Q1 and 50% = Q2 and 75% = Q3 
# => quartile seperates the data into quartiles.

In [5]:
# std 
df.std()

/var/folders/1c/j0tw7sf94_954s0xwbfd4rr00000gn/T/ipykernel_1758/1921322260.py:2: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

PassengerId    257.353842
Survived         0.486592
Pclass           0.836071
Age             14.526497
SibSp            1.102743
Parch            0.806057
Fare            49.693429
dtype: float64

In [ ]:
# selecting with loc or iloc : df['row',['column1','column2']]

#slicing :
# :: step over 
# :-1 reverse order 
# " : "  => all rows or columns

# select : df[ df['Age']>70 ] => select all rows where the age is greater than 70
# just put inside the brackets the condition you want to apply

2- Data Preprocessing

In [19]:
# check if there is any duplicated rows
df.duplicated().sum() 
# to remove the duplicated rows : df.drop_duplicates(inplace=True)

0

In [6]:
# is there any missing values ? :
# df.isnull().any()
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [35]:
# drop rows with missing values
# df.dropna(axis=0,inplace=True) => comes with data loss
# drop any ro< that contains nan value in embarked column
# df.dropna(subset=['Embarked'],inplace=True)
# deleting data is the last option

In [70]:
# show the null rows in embarked column
df[df['Embarked'].isnull()]

# show the most common value in embarked column
a = df['Embarked'].mode()

# fill the missing values with the mode of the Embarked column
df['Embarked'].fillna(a[0],inplace=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",2,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",2,62.0,0,0,113572,80.0,B28,NaN

In [42]:
# replace the missing values in the Age column with the mean of the Age column

df['Age'].isnull().sum()
a = int(df['Age'].mean())
df['Age'].fillna(a,inplace=True)

In [43]:
# check if there is any missing values left
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [ ]:
# replace the missing values in the Cabin column with diffrent cabin numbers that are not in the dataset and then replace the letter with a number in order

In [64]:
# replace the missing values in the Cabin column with 'No cabin'
df['Cabin'].fillna('No cabin',inplace=True)

0

In [65]:
#info of the dataframe using .info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [67]:
# change the type of the Embarked column to int to allow the model to work on integers

df['Embarked'].unique()
embarked_replacement = {'S':1,'C':2,'Q':3}
df['Embarked'].replace(embarked_replacement)

0      1.0
1      2.0
2      1.0
3      1.0
4      1.0
      ...
886    1.0
887    1.0
888    1.0
889    2.0
890    3.0
Name: Embarked, Length: 891, dtype: float64

In [69]:
# change Sex column to int

Sex_replacement = {'male': 1, 'female': 2}
df['Sex'].replace(Sex_replacement,inplace=True)
df['Sex']

0      1
1      2
2      2
3      2
4      1
      ..
886    1
887    2
888    2
889    1
890    1
Name: Sex, Length: 891, dtype: int64

In [15]:
# fit_transform => transforl data to numbers and train the model to be able to predict the numbers
# encoding diffrent values in the Cabin column to numbers and stores them in the object 'encoder'
le = LabelEncoder()
df['Cabin'] = le.fit_transform(df['Cabin'])
len(df['Cabin'].unique())
# use len() to get the size instead of visually identifying it

148